Merge branch 'main' of https://github.com/Gepetto-FIAP/tradebox into feat/lgpgomes
